{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\miki2000\Documents\Data_Assignment3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Dec 2022, 16:01:04

{com}. 
. 
. 
. *Upload Data for ZIP-county Crosswalks

. 
. import excel "C:\Users\miki2000\Downloads\ZIP_COUNTY_122021.xlsx", firstrow clear
{res}{text}(8 vars, 54,260 obs)

{com}. 
. 
. 
. *Drop unecessary columns

. 
. drop county

. 
. drop res_ratio

. 
. drop bus_ratio

. 
. drop oth_ratio

. 
. drop tot_ratio

. 
. 
. 
. *Drop duplicates

. 
. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(14,772 observations deleted)

{com}. 
. 
. 
. *Rename the following variables 

. 
. rename usps_zip_pref_city USPS_ZIP_PREF_CITY
{res}
{com}. 
. rename usps_zip_pref_state USPS_ZIP_PREF_STATE
{res}
{com}. 
. rename zip ZIP
{res}
{com}. 
. 
. 
. *Save Data

. 
. save "zip_county.dta", replace
{txt}{p 0 4 2}
file {bf}
zip_county.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *Upload Data for State abbreviations used as reference later on

. 
. import delimited "C:\Users\miki2000\Downloads\stateAbbreviations.csv", clear
{res}{txt}(encoding automatically selected: UTF-8)
{text}(2 vars, 51 obs)

{com}. 
. 
. 
. *Rename the following variables

. 
. rename v1 state
{res}
{com}. 
. rename v2 USPS_ZIP_PREF_STATE
{res}
{com}. 
. 
. 
. *Save data as state_abbrev.dta

. 
. save "state_abbrev.dta", replace
{txt}{p 0 4 2}
file {bf}
state_abbrev.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *Upload Data for ZIP-level Housing Prices

. 
. import excel "C:\Users\miki2000\Downloads\HPI_AT_BDL_ZIP5.xlsx", firstrow clear
{res}{text}(8 vars, 605,415 obs)

{com}. 
. 
. 
. *Convert Year type to int

. 
. destring Year, replace
{txt}Year: all characters numeric; {res}replaced {txt}as {res}int

{com}. 
. 
. 
. *Drop observations with year < 2021 

. 
. drop if Year < 2021
{txt}(586,630 observations deleted)

{com}. 
. 
. 
. *Rename FiveDigitZIPCode to ZIP

. 
. rename FiveDigitZIPCode ZIP
{res}
{com}. 
. 
. 
. *Save Zip-level Housing Prices Data

. 
. save "zip_hpi.dta", replace
{txt}{p 0 4 2}
file {bf}
zip_hpi.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *Obtain Data for County-level Housing Prices

. 
. merge m:1 ZIP using "zip_county.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          20,703
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}          20,703{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          18,785{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. 
. *Drop observations with no data for year

. 
. drop if missing(Year)
{txt}(20,703 observations deleted)

{com}. 
. 
. 
. *Cast HPI as a long

. 
. destring HPI, replace
{txt}HPI: all characters numeric; {res}replaced {txt}as {res}double
{txt}(113 missing values generated)
{res}
{com}. 
. 
. 
. *Collapse HPI by USPS_ZIP_PREF_CITY and USPS_ZIP_PREF_STATE

. 
. collapse HPI, by(USPS_ZIP_PREF_CITY USPS_ZIP_PREF_STATE)
{res}
{com}. 
. 
. 
. *Merge with state_abbrev.dta

. 
. merge m:1 USPS_ZIP_PREF_STATE using "state_abbrev.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          14,244{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. 
. *Generate county_full variable

. 
. gen county_full = lower(USPS_ZIP_PREF_CITY) + " county, " + lower(state)

. 
. 
. 
. *Drop Merge

. 
. drop _merge

. 
. 
. 
. *Save it as county_hpi.dta.

. 
. save "county_hpi.dta", replace
{txt}{p 0 4 2}
file {bf}
county_hpi.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *Upload County Census Data

. 
. import delimited "C:\Users\miki2000\Downloads\census.csv", clear 
{res}{txt}(encoding automatically selected: UTF-8)
{text}(8 vars, 3,222 obs)

{com}. 
. 
. 
. *rename variables

. 
. rename v1 county_full
{res}
{com}. 
. rename v2 population 
{res}
{com}. 
. rename v3 white_only 
{res}
{com}. 
. rename v4 black_only 
{res}
{com}. 
. rename v5 native_american_only 
{res}
{com}. 
. rename v6 asian_only 
{res}
{com}. 
. rename v7 pacific_islander_only 
{res}
{com}. 
. 
. 
. *Drop unecessary columns

. 
. drop v8

. 
. 
. 
. *Lowercase county_full data

. 
. replace county_full = lower(county_full)
{txt}(3,221 real changes made)

{com}. 
. 
. 
. *Save it as county_census.dta"

. 
. save "county_census.dta", replace
{txt}{p 0 4 2}
file {bf}
county_census.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *Upload County COVID Mortality Deaths Data

. 
. import delimited "C:\Users\miki2000\Downloads\us-counties-2020.csv", clear 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(7 vars, 884,737 obs)

{com}. 
. 
. 
. *Sort data by county 

. 
. sort county_full

. 
. 
. 
. *Collapse COVID-19 deaths by county 

. 
. collapse (sum) deaths, by(county_full)
{res}
{com}. 
. 
. 
. *Lowercase county_full data

. 
. replace county_full = lower(county_full)
{txt}(3,273 real changes made)

{com}. 
. 
. 
. *Merge with County Census Data on county_full 

. 
. merge 1:1 county_full using "county_census.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             493
{txt}{col 9}from master{col 30}{res}             272{txt}  (_merge==1)
{col 9}from using{col 30}{res}             221{txt}  (_merge==2)

{col 5}Matched{col 30}{res}           3,001{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. 
. *Drop observations missing data for population and deaths

. 
. drop if missing(population)
{txt}(272 observations deleted)

{com}. 
. drop if missing(deaths)
{txt}(221 observations deleted)

{com}. 
. 
. 
. *Cast the following variables as longs

. 
. destring white_only, replace ignore(",")
{txt}white_only: character{res} ,{txt} removed; {res}replaced {txt}as {res}long

{com}. 
. destring black_only, replace ignore(",")
{txt}black_only: character{res} ,{txt} removed; {res}replaced {txt}as {res}long

{com}. 
. destring native_american_only, replace ignore(",")
{txt}native_american_only: character{res} ,{txt} removed; {res}replaced {txt}as {res}long

{com}. 
. destring asian_only, replace ignore(",")
{txt}asian_only: character{res} ,{txt} removed; {res}replaced {txt}as {res}long

{com}. 
. destring pacific_islander_only, replace ignore(",")
{txt}pacific_islander_only: character{res} ,{txt} removed; {res}replaced {txt}as {res}long

{com}. 
. destring population, replace ignore(",")
{txt}population: character{res} ,{txt} removed; {res}replaced {txt}as {res}long

{com}. 
. 
. 
. *Generate mortality rate data 

. 
. gen mortality_rate = deaths / population

. 
. 
. 
. *Drop Merge

. 
. drop _merge

. 
. 
. 
. *Save it as county_deaths.dta"

. 
. save "county_mortality.dta", replace
{txt}{p 0 4 2}
file {bf}
county_mortality.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *Upload County HPI Data

. 
. use county_hpi.dta

. 
. 
. 
. *Merge County HPI Data with County Mortality Data on County Full

. 
. merge 1:1 county_full using "county_mortality.dta"
{res}{txt}{p 0 7 2}
(variable
{bf:county_full} was {bf:str43}, now {bf:str50} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          15,893
{txt}{col 9}from master{col 30}{res}          13,568{txt}  (_merge==1)
{col 9}from using{col 30}{res}           2,325{txt}  (_merge==2)

{col 5}Matched{col 30}{res}             676{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. 
. *Drop observations missing data for population and HPI

. 
. drop if missing(population)
{txt}(13,568 observations deleted)

{com}. 
. drop if missing(HPI)
{txt}(2,328 observations deleted)

{com}. 
. 
. 
. *Regress HPI mortality rate on white, black, asian, native american races. 

. 
. regress HPI mortality_rate white_only black_only asian_only native_american_only

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       673
{txt}{hline 13}{c +}{hline 34}   F(5, 667)       = {res}    47.20
{txt}       Model {c |} {res} 9951878.06         5  1990375.61   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 28128973.9       667  42172.3746   {txt}R-squared       ={res}    0.2613
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2558
{txt}       Total {c |} {res} 38080851.9       672  56667.9344   {txt}Root MSE        =   {res} 205.36

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                 HPI{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}mortality_rate {c |}{col 22}{res}{space 2}-260.4242{col 34}{space 2} 96.42163{col 45}{space 1}   -2.70{col 54}{space 3}0.007{col 62}{space 4}-449.7506{col 75}{space 3}-71.09771
{txt}{space 10}white_only {c |}{col 22}{res}{space 2} .0004365{col 34}{space 2} .0000792{col 45}{space 1}    5.51{col 54}{space 3}0.000{col 62}{space 4}  .000281{col 75}{space 3} .0005921
{txt}{space 10}black_only {c |}{col 22}{res}{space 2}-.0005193{col 34}{space 2} .0001871{col 45}{space 1}   -2.78{col 54}{space 3}0.006{col 62}{space 4}-.0008868{col 75}{space 3}-.0001519
{txt}{space 10}asian_only {c |}{col 22}{res}{space 2} .0014679{col 34}{space 2} .0001587{col 45}{space 1}    9.25{col 54}{space 3}0.000{col 62}{space 4} .0011563{col 75}{space 3} .0017795
{txt}native_american_only {c |}{col 22}{res}{space 2}-.0094446{col 34}{space 2}  .001887{col 45}{space 1}   -5.01{col 54}{space 3}0.000{col 62}{space 4}-.0131497{col 75}{space 3}-.0057394
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 308.4904{col 34}{space 2} 12.10562{col 45}{space 1}   25.48{col 54}{space 3}0.000{col 62}{space 4} 284.7207{col 75}{space 3} 332.2601
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. *Regress 2021 HPI on 2020 COVID19 mortality rate 

. 
. regress HPI mortality_rate 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       673
{txt}{hline 13}{c +}{hline 34}   F(1, 671)       = {res}     1.11
{txt}       Model {c |} {res} 62849.3812         1  62849.3812   {txt}Prob > F        ={res}    0.2926
{txt}    Residual {c |} {res} 38018002.6       671  56658.7222   {txt}R-squared       ={res}    0.0017
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0002
{txt}       Total {c |} {res} 38080851.9       672  56667.9344   {txt}Root MSE        =   {res} 238.03

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           HPI{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mortality_rate {c |}{col 16}{res}{space 2}-111.2828{col 28}{space 2} 105.6601{col 39}{space 1}   -1.05{col 48}{space 3}0.293{col 56}{space 4}-318.7469{col 69}{space 3} 96.18135
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 334.4487{col 28}{space 2} 13.62069{col 39}{space 1}   24.55{col 48}{space 3}0.000{col 56}{space 4} 307.7044{col 69}{space 3}  361.193
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. 
. 
. *Regress 2021 HPI on 2020 white, black, asian, native american races. 

. 
. regress HPI white_only black_only asian_only native_american_only

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       673
{txt}{hline 13}{c +}{hline 34}   F(4, 668)       = {res}    56.64
{txt}       Model {c |} {res} 9644238.83         4  2411059.71   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 28436613.1       668  42569.7801   {txt}R-squared       ={res}    0.2533
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2488
{txt}       Total {c |} {res} 38080851.9       672  56667.9344   {txt}Root MSE        =   {res} 206.32

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                 HPI{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}white_only {c |}{col 22}{res}{space 2} .0003966{col 34}{space 2} .0000782{col 45}{space 1}    5.07{col 54}{space 3}0.000{col 62}{space 4}  .000243{col 75}{space 3} .0005501
{txt}{space 10}black_only {c |}{col 22}{res}{space 2}-.0005931{col 34}{space 2}  .000186{col 45}{space 1}   -3.19{col 54}{space 3}0.001{col 62}{space 4}-.0009583{col 75}{space 3}-.0002279
{txt}{space 10}asian_only {c |}{col 22}{res}{space 2} .0014968{col 34}{space 2} .0001591{col 45}{space 1}    9.41{col 54}{space 3}0.000{col 62}{space 4} .0011844{col 75}{space 3} .0018091
{txt}native_american_only {c |}{col 22}{res}{space 2}-.0085489{col 34}{space 2} .0018663{col 45}{space 1}   -4.58{col 54}{space 3}0.000{col 62}{space 4}-.0122135{col 75}{space 3}-.0048843
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 287.1852{col 34}{space 2} 9.225877{col 45}{space 1}   31.13{col 54}{space 3}0.000{col 62}{space 4}   269.07{col 75}{space 3} 305.3005
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. 
. 
. *Regress 2021 HPI on 2020 COVID19 mortality rate, white black

. 
. regress HPI mortality_rate white_only black_only asian_only native_american_only

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       673
{txt}{hline 13}{c +}{hline 34}   F(5, 667)       = {res}    47.20
{txt}       Model {c |} {res} 9951878.06         5  1990375.61   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 28128973.9       667  42172.3746   {txt}R-squared       ={res}    0.2613
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2558
{txt}       Total {c |} {res} 38080851.9       672  56667.9344   {txt}Root MSE        =   {res} 205.36

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                 HPI{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}mortality_rate {c |}{col 22}{res}{space 2}-260.4242{col 34}{space 2} 96.42163{col 45}{space 1}   -2.70{col 54}{space 3}0.007{col 62}{space 4}-449.7506{col 75}{space 3}-71.09771
{txt}{space 10}white_only {c |}{col 22}{res}{space 2} .0004365{col 34}{space 2} .0000792{col 45}{space 1}    5.51{col 54}{space 3}0.000{col 62}{space 4}  .000281{col 75}{space 3} .0005921
{txt}{space 10}black_only {c |}{col 22}{res}{space 2}-.0005193{col 34}{space 2} .0001871{col 45}{space 1}   -2.78{col 54}{space 3}0.006{col 62}{space 4}-.0008868{col 75}{space 3}-.0001519
{txt}{space 10}asian_only {c |}{col 22}{res}{space 2} .0014679{col 34}{space 2} .0001587{col 45}{space 1}    9.25{col 54}{space 3}0.000{col 62}{space 4} .0011563{col 75}{space 3} .0017795
{txt}native_american_only {c |}{col 22}{res}{space 2}-.0094446{col 34}{space 2}  .001887{col 45}{space 1}   -5.01{col 54}{space 3}0.000{col 62}{space 4}-.0131497{col 75}{space 3}-.0057394
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 308.4904{col 34}{space 2} 12.10562{col 45}{space 1}   25.48{col 54}{space 3}0.000{col 62}{space 4} 284.7207{col 75}{space 3} 332.2601
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. *Regress 2021 HPI on 2020 COVID19 mortality rate, white black

. 
. regress HPI mortality_rate white_only black_only

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       673
{txt}{hline 13}{c +}{hline 34}   F(3, 669)       = {res}    43.74
{txt}       Model {c |} {res} 6244232.12         3  2081410.71   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 31836619.8       669  47588.3704   {txt}R-squared       ={res}    0.1640
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1602
{txt}       Total {c |} {res} 38080851.9       672  56667.9344   {txt}Root MSE        =   {res} 218.15

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           HPI{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mortality_rate {c |}{col 16}{res}{space 2}-288.0384{col 28}{space 2} 99.70071{col 39}{space 1}   -2.89{col 48}{space 3}0.004{col 56}{space 4}-483.8023{col 69}{space 3}-92.27441
{txt}{space 4}white_only {c |}{col 16}{res}{space 2} .0004906{col 28}{space 2} .0000537{col 39}{space 1}    9.13{col 48}{space 3}0.000{col 56}{space 4} .0003851{col 69}{space 3} .0005961
{txt}{space 4}black_only {c |}{col 16}{res}{space 2}-.0003602{col 28}{space 2} .0001979{col 39}{space 1}   -1.82{col 48}{space 3}0.069{col 56}{space 4}-.0007489{col 69}{space 3} .0000284
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 305.3672{col 28}{space 2} 12.82411{col 39}{space 1}   23.81{col 48}{space 3}0.000{col 56}{space 4} 280.1869{col 69}{space 3} 330.5476
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. 
. 
. 
. 
. *Close Log

. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\miki2000\Documents\Data_Assignment3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 Dec 2022, 16:05:05
{txt}{.-}
{smcl}
{txt}{sf}{ul off}