{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\miki2000\Downloads\Data_Assignment3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Dec 2022, 20:32:26

{com}. 
. 
. 
. ** CREATE ZIP TO FIPS TABLE **

. 
. 
. 
. *Upload Data for ZIP-county Crosswalks

. 
. import excel "C:\Users\miki2000\Downloads\ZIP_COUNTY_122021.xlsx", firstrow clear
{res}{text}(8 vars, 54,260 obs)

{com}. 
. 
. 
. *Drop unecessary columns

. 
. drop res_ratio

. 
. drop bus_ratio

. 
. drop oth_ratio

. 
. drop tot_ratio

. 
. 
. 
. *Drop duplicates

. 
. duplicates drop zip, force

{p 0 4}{txt}Duplicates in terms of {res} zip{p_end}

{txt}(14,772 observations deleted)

{com}. 
. 
. 
. *Rename the following variables 

. 
. rename usps_zip_pref_city USPS_ZIP_PREF_CITY
{res}
{com}. 
. rename usps_zip_pref_state USPS_ZIP_PREF_STATE
{res}
{com}. 
. rename zip ZIP
{res}
{com}. 
. 
. 
. *Save Data

. 
. save "zip_county.dta", replace
{txt}{p 0 4 2}
file {bf}
zip_county.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ** END ZIP TO FIPS TABLE **

. 
. 
. 
. *Upload Data for ZIP-level Housing Prices

. 
. import excel "C:\Users\miki2000\Downloads\HPI_AT_BDL_ZIP5.xlsx", firstrow clear
{res}{text}(8 vars, 605,415 obs)

{com}. 
. 
. 
. *Convert following variables to numeric type

. 
. destring Year, replace
{txt}Year: all characters numeric; {res}replaced {txt}as {res}int

{com}. 
. destring AnnualChange, replace
{txt}AnnualChange: all characters numeric; {res}replaced {txt}as {res}double
{txt}(31514 missing values generated)
{res}
{com}. 
. 
. 
. *Drop observations with year < 2021 

. 
. drop if Year < 2021
{txt}(586,630 observations deleted)

{com}. 
. 
. 
. *Rename FiveDigitZIPCode to ZIP

. 
. rename FiveDigitZIPCode ZIP
{res}
{com}. 
. 
. 
. *Save Zip-level Housing Prices Data

. 
. save "zip_hpi.dta", replace
{txt}{p 0 4 2}
file {bf}
zip_hpi.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *Obtain Data for County-level Housing Prices

. 
. merge m:1 ZIP using "zip_county.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          20,703
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}          20,703{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          18,785{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. 
. *Drop observations with no data for year

. 
. drop if missing(Year)
{txt}(20,703 observations deleted)

{com}. 
. 
. 
. *Collapse HPI by USPS_ZIP_PREF_CITY and USPS_ZIP_PREF_STATE

. 
. collapse AnnualChange, by(county)
{res}
{com}. 
. 
. 
. rename county fips
{res}
{com}. 
. destring fips, replace ignore(",")
{txt}fips: all characters numeric; {res}replaced {txt}as {res}long

{com}. 
. 
. 
. *rename AnnualChange to HPI_change_2021

. 
. rename AnnualChange HPI_change_2021
{res}
{com}. 
. 
. 
. *Save it as county_hpi.dta.

. 
. save "county_hpi.dta", replace
{txt}{p 0 4 2}
file {bf}
county_hpi.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. *Import Fips-Codes data

. 
. import delimited "C:\Users\miki2000\Downloads\county_fips_master.csv", clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(13 vars, 3,146 obs)

{com}. 
. duplicates drop county_name state_name, force

{p 0 4}{txt}Duplicates in terms of {res} county_name state_name{p_end}

{txt}(1 observation deleted)

{com}. 
. 
. 
. gen merge_key = county_name + " " + strtrim(state_name)

. 
. save "fips_county.dta", replace
{txt}{p 0 4 2}
file {bf}
fips_county.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *Upload County Census Data

. 
. import delimited "C:\Users\miki2000\Downloads\census.csv", clear 
{res}{txt}(encoding automatically selected: UTF-8)
{text}(10 vars, 3,221 obs)

{com}. 
. 
. 
. *rename variables

. 
. rename v1 old_county
{res}
{com}. 
. rename v2 county_name
{res}
{com}. 
. rename v3 state_name
{res}
{com}. 
. rename v4 population 
{res}
{com}. 
. rename v5 white_only 
{res}
{com}. 
. rename v6 black_only 
{res}
{com}. 
. rename v7 native_american_only 
{res}
{com}. 
. rename v8 asian_only 
{res}
{com}. 
. rename v9 pacific_islander_only 
{res}
{com}. 
. 
. 
. *Drop unecessary columns

. 
. drop old_county

. 
. drop v10

. 
. 
. 
. * Gen merge column

. 
. gen merge_key = county_name + " " + strtrim(state_name)

. 
. 
. 
. merge 1:1 merge_key using "fips_county.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}              88
{txt}{col 9}from master{col 30}{res}              82{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}           3,139{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. 
. drop if missing(fips)
{txt}(82 observations deleted)

{com}. 
. drop _merge

. 
. 
. 
. *Save it as county_census.dta"

. 
. save "county_census.dta", replace
{txt}{p 0 4 2}
file {bf}
county_census.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *Upload County COVID Mortality Deaths Data

. 
. import delimited "C:\Users\miki2000\Downloads\us-counties-2020.csv", clear 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(6 vars, 884,737 obs)

{com}. 
. 
. 
. *Collapse COVID-19 deaths by county 

. 
. collapse (sum) deaths, by(fips)
{res}
{com}. 
. 
. 
. *Merge with County Census Data on county_full 

. 
. merge 1:1 fips using "county_census.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}              98
{txt}{col 9}from master{col 30}{res}              86{txt}  (_merge==1)
{col 9}from using{col 30}{res}              12{txt}  (_merge==2)

{col 5}Matched{col 30}{res}           3,133{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. 
. *Drop observations missing data for population and deaths

. 
. drop if missing(population)
{txt}(92 observations deleted)

{com}. 
. drop if missing(deaths)
{txt}(9 observations deleted)

{com}. 
. 
. 
. *Cast the following variables as longs

. 
. destring white_only, replace ignore(",")
{txt}white_only: character{res} ,{txt} removed; {res}replaced {txt}as {res}long

{com}. 
. destring black_only, replace ignore(",")
{txt}black_only: character{res} ,{txt} removed; {res}replaced {txt}as {res}long

{com}. 
. destring native_american_only, replace ignore(",")
{txt}native_american_only: character{res} ,{txt} removed; {res}replaced {txt}as {res}long

{com}. 
. destring asian_only, replace ignore(",")
{txt}asian_only: character{res} ,{txt} removed; {res}replaced {txt}as {res}long

{com}. 
. destring pacific_islander_only, replace ignore(",")
{txt}pacific_islander_only: character{res} ,{txt} removed; {res}replaced {txt}as {res}long

{com}. 
. destring population, replace ignore(",")
{txt}population: character{res} ,{txt} removed; {res}replaced {txt}as {res}long

{com}. 
. 
. 
. *Generate mortality rate data 

. 
. gen mortality_rate = deaths / population

. 
. gen white_rate = white_only/ population

. 
. gen black_rate = black_only / population

. 
. gen native_american_rate = native_american_only/ population

. 
. gen asian_rate = asian_only / population

. 
. gen pacific_islander_rate = pacific_islander_only / population

. 
. 
. 
. 
. 
. *Drop Merge

. 
. drop _merge

. 
. 
. 
. *Save it as county_deaths.dta"

. 
. save "county_mortality.dta", replace
{txt}{p 0 4 2}
file {bf}
county_mortality.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. *Upload County HPI Data

. 
. use county_hpi.dta

. 
. 
. 
. *Merge County HPI Data with County Mortality Data on County Full

. 
. merge 1:1 fips using "county_mortality.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}             551
{txt}{col 9}from master{col 30}{res}               6{txt}  (_merge==1)
{col 9}from using{col 30}{res}             545{txt}  (_merge==2)

{col 5}Matched{col 30}{res}           2,585{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. 
. *Drop observations missing data for population and HPI

. 
. drop if missing(population)
{txt}(6 observations deleted)

{com}. 
. drop if missing(HPI_change_2021)
{txt}(554 observations deleted)

{com}. 
. 
. 
. *Regress 2021 HPI on 2020 COVID19 mortality rate, white, black, asian, native american races. 

. 
. regress HPI_change_2021 mortality_rate white_rate black_rate asian_rate native_american_rate

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,576
{txt}{hline 13}{c +}{hline 34}   F(5, 2570)      = {res}    30.70
{txt}       Model {c |} {res} 3107.20282         5  621.440564   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 52028.4335     2,570  20.2445266   {txt}R-squared       ={res}    0.0564
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0545
{txt}       Total {c |} {res} 55135.6363     2,575  21.4118976   {txt}Root MSE        =   {res} 4.4994

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     HPI_change_2021{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}mortality_rate {c |}{col 22}{res}{space 2}-6.631244{col 34}{space 2} 1.036677{col 45}{space 1}   -6.40{col 54}{space 3}0.000{col 62}{space 4}-8.664051{col 75}{space 3}-4.598438
{txt}{space 10}white_rate {c |}{col 22}{res}{space 2}-9.620427{col 34}{space 2} 1.092957{col 45}{space 1}   -8.80{col 54}{space 3}0.000{col 62}{space 4}-11.76359{col 75}{space 3}-7.477261
{txt}{space 10}black_rate {c |}{col 22}{res}{space 2}-11.23602{col 34}{space 2} 1.235382{col 45}{space 1}   -9.10{col 54}{space 3}0.000{col 62}{space 4}-13.65847{col 75}{space 3}-8.813576
{txt}{space 10}asian_rate {c |}{col 22}{res}{space 2}-18.50079{col 34}{space 2} 3.671025{col 45}{space 1}   -5.04{col 54}{space 3}0.000{col 62}{space 4}-25.69926{col 75}{space 3}-11.30232
{txt}native_american_rate {c |}{col 22}{res}{space 2} -9.04836{col 34}{space 2} 2.116351{col 45}{space 1}   -4.28{col 54}{space 3}0.000{col 62}{space 4}-13.19829{col 75}{space 3}-4.898435
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 20.27961{col 34}{space 2} 1.003138{col 45}{space 1}   20.22{col 54}{space 3}0.000{col 62}{space 4} 18.31257{col 75}{space 3} 22.24665
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. 
. 
. *Regress 2021 HPI on 2020 COVID19 mortality rate 

. 
. regress HPI_change_2021 mortality_rate 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,576
{txt}{hline 13}{c +}{hline 34}   F(1, 2574)      = {res}    60.47
{txt}       Model {c |} {res}  1265.6089         1   1265.6089   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 53870.0274     2,574  20.9285266   {txt}R-squared       ={res}    0.0230
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0226
{txt}       Total {c |} {res} 55135.6363     2,575  21.4118976   {txt}Root MSE        =   {res} 4.5748

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}HPI_chang~2021{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mortality_rate {c |}{col 16}{res}{space 2}-7.240458{col 28}{space 2}  .931077{col 39}{space 1}   -7.78{col 48}{space 3}0.000{col 56}{space 4}-9.066194{col 69}{space 3}-5.414722
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  11.4857{col 28}{space 2} .1293416{col 39}{space 1}   88.80{col 48}{space 3}0.000{col 56}{space 4} 11.23208{col 69}{space 3} 11.73933
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. 
. 
. *Regress 2021 HPI on 2020 white, black, asian, native american races. 

. 
. regress HPI_change_2021 white_rate black_rate asian_rate native_american_rate

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,576
{txt}{hline 13}{c +}{hline 34}   F(4, 2571)      = {res}    27.71
{txt}       Model {c |} {res} 2278.85843         4  569.714607   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 52856.7779     2,571  20.5588401   {txt}R-squared       ={res}    0.0413
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0398
{txt}       Total {c |} {res} 55135.6363     2,575  21.4118976   {txt}Root MSE        =   {res} 4.5342

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     HPI_change_2021{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      t{col 54}   P>|t|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}white_rate {c |}{col 22}{res}{space 2}-8.965594{col 34}{space 2} 1.096567{col 45}{space 1}   -8.18{col 54}{space 3}0.000{col 62}{space 4}-11.11584{col 75}{space 3} -6.81535
{txt}{space 10}black_rate {c |}{col 22}{res}{space 2}-12.77661{col 34}{space 2} 1.221047{col 45}{space 1}  -10.46{col 54}{space 3}0.000{col 62}{space 4}-15.17095{col 75}{space 3}-10.38228
{txt}{space 10}asian_rate {c |}{col 22}{res}{space 2}-17.44218{col 34}{space 2} 3.695652{col 45}{space 1}   -4.72{col 54}{space 3}0.000{col 62}{space 4}-24.68894{col 75}{space 3}-10.19543
{txt}native_american_rate {c |}{col 22}{res}{space 2}-10.21981{col 34}{space 2} 2.124717{col 45}{space 1}   -4.81{col 54}{space 3}0.000{col 62}{space 4}-14.38614{col 75}{space 3} -6.05348
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 19.24981{col 34}{space 2} .9977916{col 45}{space 1}   19.29{col 54}{space 3}0.000{col 62}{space 4} 17.29325{col 75}{space 3} 21.20636
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. 
. 
. *Regress 2021 HPI on 2020 COVID19 mortality rate, white black

. 
. regress HPI_change_2021 mortality_rate white_rate black_rate

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,576
{txt}{hline 13}{c +}{hline 34}   F(3, 2572)      = {res}    39.81
{txt}       Model {c |} {res} 2446.74312         3   815.58104   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 52688.8932     2,572  20.4855728   {txt}R-squared       ={res}    0.0444
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0433
{txt}       Total {c |} {res} 55135.6363     2,575  21.4118976   {txt}Root MSE        =   {res} 4.5261

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}HPI_chang~2021{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
mortality_rate {c |}{col 16}{res}{space 2}-6.699666{col 28}{space 2} 1.035542{col 39}{space 1}   -6.47{col 48}{space 3}0.000{col 56}{space 4}-8.730247{col 69}{space 3}-4.669086
{txt}{space 4}white_rate {c |}{col 16}{res}{space 2}-5.270091{col 28}{space 2} .7864788{col 39}{space 1}   -6.70{col 48}{space 3}0.000{col 56}{space 4}-6.812287{col 69}{space 3}-3.727895
{txt}{space 4}black_rate {c |}{col 16}{res}{space 2} -7.07809{col 28}{space 2} .9915835{col 39}{space 1}   -7.14{col 48}{space 3}0.000{col 56}{space 4}-9.022473{col 69}{space 3}-5.133707
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 16.12529{col 28}{space 2} .6938021{col 39}{space 1}   23.24{col 48}{space 3}0.000{col 56}{space 4} 14.76482{col 69}{space 3} 17.48576
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. 
. 
. *Plot twoway scatter plot on HPI and mortality_rate variables. 

. 
. twoway (scatter HPI_change_2021 mortality_rate), ytitle(HPI Change in 2021) xtitle(2020 COVID-19 Per Capita Mortality Rate)
{res}
{com}. 
. 
. 
. 
. 
. *Close Log

. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\miki2000\Downloads\Data_Assignment3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 6 Dec 2022, 20:33:07
{txt}{.-}
{smcl}
{txt}{sf}{ul off}